-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: localhost    Database: volunteer
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `cities`
--

DROP TABLE IF EXISTS `cities`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cities` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(150) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1265 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cities`
--

LOCK TABLES `cities` WRITE;
/*!40000 ALTER TABLE `cities` DISABLE KEYS */;
INSERT INTO `cities` VALUES (1,'אבו ג\'וויעד'),(2,'אבו גוש'),(3,'אבו סנאן'),(4,'אבו סריחאן'),(5,'אבו עבדון'),(6,'אבו עמאר'),(7,'אבו עמרה'),(8,'אבו קרינאת'),(9,'אבו רובייעה'),(10,'אבו רוקייק'),(11,'אבו תלול'),(12,'אבטין'),(13,'אבטליון'),(14,'אביאל'),(15,'אביבים'),(16,'אביגדור'),(17,'אביחיל'),(18,'אביטל'),(19,'אביעזר'),(20,'אבירים'),(21,'אבן יהודה'),(22,'אבן מנחם'),(23,'אבן ספיר'),(24,'אבן שמואל'),(25,'אבני איתן'),(26,'אבני חפץ'),(27,'אבנת'),(28,'אבשלום'),(29,'אדורה'),(30,'אדירים'),(31,'אדמית'),(32,'אדרת'),(33,'אודים'),(34,'אודם'),(35,'אוהד'),(36,'אום אל-פחם'),(37,'אום אל-קוטוף'),(38,'אום בטין'),(39,'אומן'),(40,'אומץ'),(41,'אופקים'),(42,'אור הגנוז'),(43,'אור הנר'),(44,'אור יהודה'),(45,'אור עקיבא'),(46,'אורה'),(47,'אורות'),(48,'אורטל'),(49,'אורים'),(50,'אורנים'),(51,'אורנית'),(52,'אושה'),(53,'אזור'),(54,'אחווה'),(55,'אחוזם'),(56,'אחוזת ברק'),(57,'אחיהוד'),(58,'אחיטוב'),(59,'אחיסמך'),(60,'אחיעזר'),(61,'אטרש'),(62,'איבים'),(63,'אייל'),(64,'איילת השחר'),(65,'אילון'),(66,'אילות'),(67,'אילניה'),(68,'אילת'),(69,'אירוס'),(70,'איתמר'),(71,'איתן'),(72,'איתנים'),(73,'אכסאל'),(74,'אל סייד'),(75,'אל-עזי'),(76,'אל-עריאן'),(77,'אל-רום'),(78,'אלומה'),(79,'אלומות'),(80,'אלון הגליל'),(81,'אלון מורה'),(82,'אלון שבות'),(83,'אלוני אבא'),(84,'אלוני הבשן'),(85,'אלוני יצחק'),(86,'אלונים'),(87,'אלי-עד'),(88,'אליאב'),(89,'אליכין'),(90,'אליפז'),(91,'אליפלט'),(92,'אליקים'),(93,'אלישיב'),(94,'אלישמע'),(95,'אלמגור'),(96,'אלמוג'),(97,'אלעד'),(98,'אלעזר'),(99,'אלפי מנשה'),(100,'אלקוש'),(101,'אלקנה'),(102,'אמונים'),(103,'אמירים'),(104,'אמנון'),(105,'אמציה'),(106,'אניעם'),(107,'אסד'),(108,'אספר'),(109,'אעבלין'),(110,'אעצם'),(111,'אפיניש'),(112,'אפיק'),(113,'אפיקים'),(114,'אפק'),(115,'אפרת'),(116,'ארבל'),(117,'ארגמן'),(118,'ארז'),(119,'אריאל'),(120,'ארסוף'),(121,'אשבול'),(122,'אשבל'),(123,'אשדוד'),(124,'אשדות יעקב'),(125,'אשחר'),(126,'אשכולות'),(127,'אשל הנשיא'),(128,'אשלים'),(129,'אשקלון'),(130,'אשרת'),(131,'אשתאול'),(132,'אתגר'),(133,'באקה אל-גרביה'),(134,'באר אורה'),(135,'באר גנים'),(136,'באר טוביה'),(137,'באר יעקב'),(138,'באר מילכה'),(139,'באר שבע'),(140,'בארות יצחק'),(141,'בארותיים'),(142,'בארי'),(143,'בוסתן הגליל'),(144,'בועיינה-נוג\'ידאת'),(145,'בוקעאתא'),(146,'בורגתה'),(147,'בחן'),(148,'בטחה'),(149,'ביצרון'),(150,'ביר אל-מכסור'),(151,'ביר הדאג\''),(152,'ביריה'),(153,'בית אורן'),(154,'בית אל'),(155,'בית אלעזרי'),(156,'בית אלפא'),(157,'בית אריה'),(158,'בית ברל'),(159,'בית ג\'ן'),(160,'בית גוברין'),(161,'בית גמליאל'),(162,'בית דגן'),(163,'בית הגדי'),(164,'בית הלוי'),(165,'בית הלל'),(166,'בית העמק'),(167,'בית הערבה'),(168,'בית השיטה'),(169,'בית זיד'),(170,'בית זית'),(171,'בית זרע'),(172,'בית חורון'),(173,'בית חירות'),(174,'בית חלקיה'),(175,'בית חנן'),(176,'בית חנניה'),(177,'בית חשמונאי'),(178,'בית יהושע'),(179,'בית יוסף'),(180,'בית ינאי'),(181,'בית יצחק-שער חפר'),(182,'בית לחם הגלילית'),(183,'בית מאיר'),(184,'בית נחמיה'),(185,'בית ניר'),(186,'בית נקופה'),(187,'בית עובד'),(188,'בית עוזיאל'),(189,'בית עזרא'),(190,'בית עריף'),(191,'בית צבי'),(192,'בית קמה'),(193,'בית קשת'),(194,'בית רבן'),(195,'בית רימון'),(196,'בית שאן'),(197,'בית שמש'),(198,'בית שערים'),(199,'בית שקמה'),(200,'ביתן אהרן'),(201,'ביתר עילית'),(202,'בלפוריה'),(203,'בן זכאי'),(204,'בן עמי'),(205,'כפר נוער'),(206,'בן שמן'),(207,'בני ברק'),(208,'בני דקלים'),(209,'בני דרום'),(210,'בני דרור'),(211,'בני יהודה'),(212,'בני נצרים'),(213,'בני עטרות'),(214,'בני עיש'),(215,'בני ציון'),(216,'בני ראם'),(217,'בניה'),(218,'בנימינה-גבעת עדה'),(219,'בסמה'),(220,'בסמת טבעון'),(221,'בענה'),(222,'בצרה'),(223,'בצת'),(224,'בקוע'),(225,'בקעות'),(226,'בר גיורא'),(227,'בר יוחאי'),(228,'ברוכין'),(229,'ברור חיל'),(230,'ברוש'),(231,'ברכה'),(232,'ברכיה'),(233,'ברעם'),(234,'ברק'),(235,'ברקאי'),(236,'ברקן'),(237,'ברקת'),(238,'בת הדר'),(239,'בת חן'),(240,'בת חפר'),(241,'בת חצור'),(242,'בת ים'),(243,'בת עין'),(244,'בת שלמה'),(245,'ג\'דיידה-מכר'),(246,'ג\'ולס'),(247,'ג\'לג\'וליה'),(248,'ג\'נאביב'),(249,'ג\'סר א-זרקא'),(250,'גוש חלב'),(251,'ג\'ת'),(252,'גאולי תימן'),(253,'גאולים'),(254,'גאליה'),(255,'גבולות'),(256,'גבים'),(257,'גבע'),(258,'גבע בנימין'),(259,'גבע כרמל'),(260,'גבעולים'),(261,'גבעון החדשה'),(262,'גבעות בר'),(263,'גבעת אבני'),(264,'גבעת אלה'),(265,'גבעת ברנר'),(266,'גבעת השלושה'),(267,'גבעת זאב'),(268,'גבעת חן'),(269,'גבעת חיים'),(270,'גבעת יואב'),(271,'גבעת יערים'),(272,'גבעת ישעיהו'),(273,'גבעת כח'),(274,'גבעת נילי'),(275,'גבעת עוז'),(276,'גבעת שמואל'),(277,'גבעת שמש'),(278,'גבעת שפירא'),(279,'גבעתי'),(280,'גבעתיים'),(281,'גברעם'),(282,'גבת'),(283,'גדות'),(284,'גדיש'),(285,'גדעונה'),(286,'גדרה'),(287,'גונן'),(288,'גורן'),(289,'גורנות הגליל'),(290,'גזית'),(291,'גזר'),(292,'גיאה'),(293,'גיבתון'),(294,'גיזו'),(295,'גילון'),(296,'גילת'),(297,'גינוסר'),(298,'גיניגר'),(299,'גינתון'),(300,'גיתה'),(301,'גיתית'),(302,'גלאון'),(303,'גלגל'),(304,'גלילים'),(305,'אבן יצחק'),(306,'גמזו'),(307,'גן הדרום'),(308,'גן השומרון'),(309,'גן חיים'),(310,'גן יאשיה'),(311,'גן יבנה'),(312,'גן נר'),(313,'גן שורק'),(314,'גן שלמה'),(315,'גן שמואל'),(316,'גנות'),(317,'גנות הדר'),(318,'גני הדר'),(319,'גני טל'),(320,'גני יוחנן'),(321,'גני מודיעין'),(322,'גני עם'),(323,'גני תקווה'),(324,'געש'),(325,'געתון'),(326,'גפן'),(327,'גרופית'),(328,'גשור'),(329,'גשר'),(330,'גשר הזיו'),(332,'גת רימון'),(333,'דאלית אל-כרמל'),(334,'דבורה'),(335,'דבוריה'),(336,'דבירה'),(337,'דברת'),(338,'דגניה א\''),(339,'דגניה ב\''),(340,'דובב'),(341,'דולב'),(342,'דור'),(343,'דורות'),(344,'דחי'),(345,'דיר אל-אסד'),(346,'דיר חנא'),(347,'דיר ראפאת'),(348,'דימונה'),(349,'דישון'),(350,'דליה'),(351,'דלתון'),(352,'דמיידה'),(353,'דן'),(354,'דפנה'),(355,'דקל'),(356,'דריג\'את'),(357,'האון'),(358,'הבונים'),(359,'הגושרים'),(360,'הדר עם'),(361,'הוד השרון'),(362,'הודיה'),(363,'הודיות'),(364,'הוואשלה'),(365,'הוזייל'),(366,'הושעיה'),(367,'הזורע'),(368,'הזורעים'),(369,'החותרים'),(370,'היוגב'),(371,'הילה'),(372,'המעפיל'),(373,'הסוללים'),(374,'העוגן'),(375,'הר אדר'),(376,'הר גילה'),(377,'הר עמשא'),(378,'הראל'),(379,'הרדוף'),(380,'הרצליה'),(381,'הררית'),(382,'ורד יריחו'),(383,'ורדון'),(384,'זבארגה'),(385,'זבדיאל'),(386,'זוהר'),(387,'זיקים'),(388,'זיתן'),(389,'זכרון יעקב'),(390,'זכריה'),(391,'זמר'),(392,'זמרת'),(393,'זנוח'),(394,'זרועה'),(395,'זרזיר'),(396,'זרחיה'),(397,'ח\'ואלד'),(398,'חבצלת השרון'),(399,'חבר'),(400,'חברון'),(401,'חגור'),(402,'חגי'),(403,'חגלה'),(404,'חד-נס'),(405,'חדיד'),(406,'חדרה'),(407,'חוג\'ייראת'),(408,'חולדה'),(409,'חולון'),(410,'חולית'),(411,'חולתה'),(412,'חוסן'),(413,'חוסנייה'),(414,'חופית'),(415,'חוקוק'),(416,'חורה'),(417,'חורפיש'),(418,'חורשים'),(419,'חזון'),(420,'חיבת ציון'),(421,'חיננית'),(422,'חיפה'),(423,'חירות'),(424,'חלוץ'),(425,'חלמיש'),(426,'חלץ'),(427,'חמאם'),(428,'חמד'),(429,'חמדיה'),(430,'חמדת'),(431,'חמרה'),(432,'חניאל'),(433,'חניתה'),(434,'חנתון'),(435,'חספין'),(436,'חפץ חיים'),(437,'חפצי-בה'),(438,'חצב'),(439,'חצבה'),(440,'חצור הגלילית'),(441,'חצור-אשדוד'),(442,'חצר בארותיים'),(443,'חצרות חולדה'),(444,'חצרות יסף'),(445,'חצרות כ\'\'ח'),(446,'חצרים'),(447,'חרב לאת'),(448,'חרוצים'),(449,'חריש'),(450,'חרמש'),(451,'חרשים'),(452,'חשמונאים'),(453,'טבריה'),(454,'טובא-זנגריה'),(455,'טורעאן'),(456,'טייבה'),(457,'טירה'),(458,'טירת יהודה'),(459,'טירת כרמל'),(460,'טירת צבי'),(461,'טל שחר'),(462,'טל-אל'),(463,'טללים'),(464,'טלמון'),(465,'טמרה'),(466,'יזרעאל'),(467,'טנא'),(468,'טפחות'),(469,'יאנוח-ג\'ת'),(470,'יבול'),(471,'יבנאל'),(472,'יבנה'),(473,'יגור'),(474,'יגל'),(475,'יד בנימין'),(476,'יד השמונה'),(477,'יד חנה'),(478,'יד מרדכי'),(479,'יד נתן'),(480,'יד רמב\'\'ם'),(481,'ידידה'),(482,'יהוד-מונוסון'),(483,'יהל'),(484,'יובל'),(485,'יובלים'),(486,'יודפת'),(487,'יונתן'),(488,'יושיביה'),(490,'יחיעם'),(491,'יטבתה'),(492,'ייט\'\'ב'),(493,'יכיני'),(494,'ינוב'),(495,'ינון'),(496,'יסוד המעלה'),(497,'יסודות'),(498,'יסעור'),(499,'יעד'),(500,'יעל'),(501,'יעף'),(502,'יערה'),(503,'יפיע'),(504,'יפית'),(505,'יפעת'),(506,'יפתח'),(507,'יצהר'),(508,'יציץ'),(509,'יקום'),(510,'יקיר'),(511,'יקנעם'),(512,'יקנעם עילית'),(513,'יראון'),(514,'ירדנה'),(515,'ירוחם'),(516,'ירושלים'),(517,'ירחיב'),(518,'ירכא'),(519,'ירקונה'),(520,'ישע'),(521,'ישעי'),(522,'ישרש'),(523,'יתד'),(524,'יתיר'),(525,'כאבול'),(526,'כאוכב אבו אל-היג\'א'),(527,'כברי'),(528,'כדורי'),(529,'כדיתה'),(530,'כוכב השחר'),(531,'כוכב יאיר'),(532,'כוכב יעקב'),(533,'כוכב מיכאל'),(534,'כורזים'),(535,'כחל'),(536,'כחלה'),(537,'כיסופים'),(538,'כישור'),(539,'כליל'),(540,'כלנית'),(541,'כמאנה'),(542,'כמהין'),(543,'כמון'),(544,'כנות'),(545,'כנף'),(546,'כנרת'),(547,'כסיפה'),(548,'כסלון'),(549,'כסרא-סמיע'),(550,'כעביה-טבאש-חג\'אג\'רה'),(551,'כפר אביב'),(552,'כפר אדומים'),(553,'כפר אוריה'),(554,'כפר אחים'),(555,'כפר ביאליק'),(556,'כפר ביל\'ו'),(557,'כפר בלום'),(558,'כפר בן נון'),(559,'כפר ברא'),(560,'כפר ברוך'),(561,'כפר גדעון'),(562,'כפר גלים'),(563,'כפר גליקסון'),(564,'כפר גלעדי'),(565,'כפר דניאל'),(566,'כפר האורנים'),(567,'כפר החורש'),(568,'כפר המכבי'),(569,'כפר הנגיד'),(570,'כפר הנוער הדתי'),(571,'כפר הנשיא'),(572,'כפר הס'),(573,'כפר הרא\'\'ה'),(574,'כפר הרי\'\'ף'),(575,'כפר ויתקין'),(576,'כפר ורבורג'),(577,'כפר ורדים'),(578,'כפר זוהרים'),(579,'כפר זיתים'),(580,'כפר חב\'\'ד'),(581,'כפר חושן'),(582,'כפר חיטים'),(583,'כפר חיים'),(584,'כפר חנניה'),(585,'כפר חסידים א\''),(586,'כפר חסידים ב\''),(587,'כפר חרוב'),(588,'כפר טרומן'),(589,'כפר יאסיף'),(590,'כפר ידידיה'),(591,'כפר יהושע'),(592,'כפר יונה'),(593,'כפר יחזקאל'),(594,'כפר יעבץ'),(595,'כפר כמא'),(596,'כפר כנא'),(597,'כפר מונש'),(598,'כפר מימון'),(599,'כפר מל\'\'ל'),(600,'כפר מנדא'),(601,'כפר מנחם'),(602,'כפר מסריק'),(603,'כפר מצר'),(604,'כפר מרדכי'),(605,'כפר נטר'),(606,'כפר סאלד'),(607,'כפר סבא'),(608,'כפר סילבר'),(609,'כפר סירקין'),(610,'כפר עבודה'),(611,'כפר עזה'),(612,'כפר עציון'),(613,'כפר פינס'),(614,'כפר קאסם'),(615,'כפר קיש'),(616,'כפר קרע'),(617,'כפר ראש הנקרה'),(618,'זרעית'),(619,'כפר רופין'),(620,'כפר רות'),(621,'כפר שמאי'),(622,'כפר שמואל'),(623,'כפר שמריהו'),(624,'כפר תבור'),(625,'כפר תפוח'),(626,'כרי דשא'),(627,'כרכום'),(628,'כרם בן זמרה'),(629,'כרם בן שמן'),(630,'כרם יבנה'),(631,'כרם מהר\'\'ל'),(632,'כרם שלום'),(633,'כרמי יוסף'),(634,'כרמי צור'),(635,'כרמי קטיף'),(636,'כרמיאל'),(637,'כרמיה'),(638,'כרמים'),(639,'כרמל'),(640,'לבון'),(641,'לביא'),(642,'לבנים'),(643,'להב'),(644,'להבות הבשן'),(645,'להבות חביבה'),(646,'להבים'),(647,'לוד'),(648,'לוזית'),(649,'לוחמי הגיטאות'),(650,'לוטם'),(651,'לוטן'),(652,'לימן'),(653,'לכיש'),(654,'לפיד'),(655,'לפידות'),(656,'לקיה'),(657,'מאור'),(658,'מאיר שפיה'),(659,'מבוא ביתר'),(660,'מבוא דותן'),(661,'מבוא חורון'),(662,'מבוא חמה'),(663,'מבוא מודיעים'),(664,'מבואות ים'),(665,'מבועים'),(666,'מבטחים'),(667,'מבקיעים'),(668,'מבשרת ציון'),(669,'מג\'ד אל-כרום'),(670,'מג\'דל שמס'),(671,'מגאר'),(672,'מגדים'),(673,'מגדל'),(674,'מגדל העמק'),(675,'מגדל עוז'),(676,'מגדלים'),(677,'מגידו'),(678,'מגל'),(679,'מגן'),(680,'מגן שאול'),(681,'מגשימים'),(682,'מדרך עוז'),(683,'מדרשת בן גוריון'),(684,'מדרשת רופין'),(685,'מודיעין עילית'),(686,'מודיעין-מכבים-רעות'),(687,'מולדה'),(688,'מולדת'),(689,'מוצא עילית'),(690,'מוקייבלה'),(691,'מורן'),(692,'מורשת'),(693,'מזור'),(694,'מזכרת בתיה'),(695,'מזרע'),(696,'מזרעה'),(697,'מחולה'),(698,'מחנה הילה'),(699,'מחנה טלי'),(700,'מחנה יהודית'),(701,'מחנה יוכבד'),(702,'מחנה יפה'),(703,'מחנה יתיר'),(704,'מחנה מרים'),(705,'מחנה עדי'),(706,'מחנה תל נוף'),(707,'מחניים'),(708,'מחסיה'),(709,'מטולה'),(710,'מטע'),(711,'מי עמי'),(712,'מיטב'),(713,'מייסר'),(714,'מיצר'),(715,'מירב'),(716,'מירון'),(717,'מישר'),(718,'מיתר'),(719,'מכורה'),(720,'מכחול'),(721,'מכמורת'),(722,'מכמנים'),(723,'מלאה'),(724,'מלילות'),(725,'מלכיה'),(726,'מלכישוע'),(727,'מנוחה'),(728,'מנוף'),(729,'מנות'),(730,'מנחמיה'),(731,'מנרה'),(732,'מנשית זבדה'),(733,'מסד'),(734,'מסדה'),(735,'מסילות'),(736,'מסילת ציון'),(737,'מסלול'),(738,'מסעדה'),(739,'מסעודין אל-עזאזמה'),(740,'מעברות'),(741,'מעגלים'),(742,'מעגן'),(743,'מעגן מיכאל'),(744,'מעוז חיים'),(745,'מעון'),(746,'מעונה'),(747,'מעיליא'),(748,'מעין ברוך'),(749,'מעין צבי'),(750,'מעלה אדומים'),(751,'מעלה אפרים'),(752,'מעלה גלבוע'),(753,'מעלה גמלא'),(754,'מעלה החמישה'),(755,'מעלה לבונה'),(756,'מעלה מכמש'),(757,'מעלה עירון'),(758,'מעלה עמוס'),(759,'מעלה שומרון'),(760,'מעלות-תרשיחא'),(761,'מענית'),(762,'מעש'),(763,'מפלסים'),(764,'מצדות יהודה'),(765,'מצובה'),(766,'מצליח'),(767,'מצפה'),(768,'מצפה אביב'),(769,'מצפה אילן'),(770,'מצפה יריחו'),(771,'מצפה נטופה'),(772,'מצפה רמון'),(773,'מצפה שלם'),(774,'מצר'),(775,'מקווה ישראל'),(776,'מרגליות'),(777,'מרום גולן'),(778,'מרחב עם'),(780,'מרחביה '),(781,'מרכז שפירא'),(782,'משאבי שדה'),(783,'משגב דב'),(784,'משגב עם'),(785,'משהד'),(786,'משואה'),(787,'משואות יצחק'),(788,'משכיות'),(789,'משמר איילון'),(790,'משמר דוד'),(791,'משמר הירדן'),(792,'משמר הנגב'),(793,'משמר העמק'),(794,'משמר השבעה'),(795,'משמר השרון'),(796,'משמרות'),(797,'משמרת'),(798,'משען'),(799,'מתן'),(800,'מתת'),(801,'מתתיהו'),(802,'נאות גולן'),(803,'נאות הכיכר'),(804,'נאות מרדכי'),(805,'נאות סמדר'),(806,'נאעורה'),(807,'נבטים'),(808,'נגבה'),(809,'נגוהות'),(810,'נהורה'),(811,'נהלל'),(812,'נהריה'),(813,'נוב'),(814,'נוגה'),(815,'נווה'),(816,'נווה אבות'),(817,'נווה אור'),(818,'נווה אטיב'),(819,'נווה אילן'),(820,'נווה איתן'),(821,'נווה דניאל'),(822,'נווה זוהר'),(823,'נווה זיו'),(824,'נווה חריף'),(825,'נווה ים'),(826,'נווה ימין'),(827,'נווה ירק'),(828,'נווה מבטח'),(829,'נווה מיכאל'),(830,'נווה שלום'),(831,'נועם'),(832,'נוף איילון'),(833,'נופים'),(834,'נופית'),(835,'נופך'),(836,'נוקדים'),(837,'נורדיה'),(838,'נורית'),(839,'נחושה'),(840,'נחל עוז'),(841,'נחלה'),(842,'נחליאל'),(843,'נחלים'),(844,'נחם'),(845,'נחף'),(846,'נחשולים'),(847,'נחשון'),(848,'נחשונים'),(849,'נטועה'),(850,'נטור'),(851,'נטע'),(852,'נטעים'),(853,'נטף'),(854,'ניין'),(855,'נילי'),(856,'ניצן'),(857,'ניצן ב\''),(858,'ניצנה קהילת חינוך'),(859,'ניצני סיני'),(860,'ניצני עוז'),(861,'ניצנים'),(862,'ניר אליהו'),(863,'ניר בנים'),(864,'ניר גלים'),(865,'ניר דוד תל עמל'),(866,'ניר חן'),(867,'ניר יפה'),(868,'ניר יצחק'),(869,'ניר ישראל'),(870,'ניר משה'),(871,'ניר עוז'),(872,'ניר עם'),(873,'ניר עציון'),(874,'ניר עקיבא'),(875,'ניר צבי'),(876,'נירים'),(877,'נירית'),(878,'נירן'),(879,'נמרוד'),(880,'נס הרים'),(881,'נס עמים'),(882,'נס ציונה'),(883,'נעורים'),(884,'נעלה'),(885,'נעמה'),(886,'נען'),(887,'נצאצרה '),(888,'נצר חזני'),(889,'נצר סרני'),(890,'נצרת'),(891,'נצרת עילית'),(892,'נשר'),(893,'נתיב הגדוד'),(894,'נתיב הלה'),(895,'נתיב העשרה'),(896,'נתיב השיירה'),(897,'נתיבות'),(898,'נתניה'),(899,'סאג\'ור'),(900,'סאסא'),(901,'סביון'),(902,'סגולה'),(903,'סואעד חמרייה'),(904,'סואעד כמאנה '),(905,'סולם'),(906,'סוסיה'),(907,'סופה'),(908,'סח\'נין'),(909,'סייד '),(910,'סלמה'),(911,'סלעית'),(912,'סמר'),(913,'סנסנה'),(914,'סעד'),(915,'סער'),(916,'ספיר'),(917,'סתריה'),(918,'ע\'ג\'ר'),(919,'עבדון'),(920,'עברון'),(921,'עגור'),(922,'עדי'),(923,'עדנים'),(924,'עוזה'),(925,'עוזייר'),(926,'עולש'),(927,'עומר'),(928,'עופר'),(929,'עופרה'),(930,'עוצם'),(931,'עוקבי בנו עוקבה'),(932,'עזוז'),(933,'עזר'),(934,'עזריאל'),(935,'עזריה'),(936,'עזריקם'),(937,'עטאוונה '),(938,'עטרת'),(939,'עידן'),(940,'עיילבון'),(941,'עיינות'),(942,'עילוט'),(943,'עין איילה'),(944,'עין אל-אסד'),(945,'עין גב'),(946,'עין גדי'),(947,'עין דור'),(948,'עין הבשור'),(949,'עין הוד'),(950,'עין החורש'),(951,'עין המפרץ'),(952,'עין הנצי\'ב'),(953,'עין העמק'),(954,'עין השופט'),(955,'עין השלושה'),(956,'עין ורד'),(957,'עין זיוון'),(958,'עין חוד'),(959,'עין חצבה'),(960,'עין חרוד איחוד'),(961,'עין חרוד מאוחד'),(962,'עין יהב'),(963,'עין יעקב'),(964,'עין כרם-בי\'ס חקלאי'),(965,'עין כרמל'),(966,'עין מאהל'),(967,'עין נקובא'),(968,'עין עירון'),(969,'עין צורים'),(970,'עין קנייא'),(971,'עין ראפה'),(972,'עין שמר'),(973,'עין שריד'),(974,'עין תמר'),(975,'עינת'),(976,'עיר אובות'),(977,'עכו'),(978,'עלומים'),(979,'עלי'),(980,'עלי זהב'),(981,'עלמה'),(982,'עלמון'),(983,'עמוקה'),(984,'עמינדב'),(985,'עמיעד'),(986,'עמיעוז'),(987,'עמיקם'),(988,'עמיר'),(989,'עמנואל'),(990,'עמקה'),(991,'ענב'),(992,'עספיא'),(993,'עפולה'),(994,'עץ אפרים'),(995,'עצמון שגב'),(996,'עראבה'),(997,'עראמשה'),(998,'ערב אל נעים'),(999,'ערד'),(1000,'ערוגות'),(1001,'ערערה'),(1002,'ערערה-בנגב'),(1264,'ברטעה');
/*!40000 ALTER TABLE `cities` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `customers`
--

DROP TABLE IF EXISTS `customers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `customers` (
  `id` int NOT NULL AUTO_INCREMENT,
  `first_name` varchar(50) DEFAULT NULL,
  `last_name` varchar(50) DEFAULT NULL,
  `user_name` varchar(11) DEFAULT NULL,
  `phone` varchar(10) DEFAULT NULL,
  `t_phone` varchar(10) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `password` text,
  `status` enum('active','deleted') DEFAULT NULL,
  `city` varchar(100) DEFAULT NULL,
  `street` varchar(50) DEFAULT NULL,
  `postal_code` varchar(9) DEFAULT NULL,
  `gender` enum('male','female','other','prefere not to say') DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `customers`
--

LOCK TABLES `customers` WRITE;
/*!40000 ALTER TABLE `customers` DISABLE KEYS */;
/*!40000 ALTER TABLE `customers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `events`
--

DROP TABLE IF EXISTS `events`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `events` (
  `id` int NOT NULL AUTO_INCREMENT,
  `description` varchar(100) NOT NULL,
  `location` varchar(45) DEFAULT NULL,
  `name` varchar(45) DEFAULT NULL,
  `creator` int DEFAULT NULL,
  `participents` varchar(200) DEFAULT NULL,
  `creation_time` varchar(45) DEFAULT NULL,
  `creation_date` varchar(45) DEFAULT NULL,
  `start_time` varchar(45) DEFAULT NULL,
  `end_time` varchar(45) DEFAULT NULL,
  `start_date` varchar(45) DEFAULT NULL,
  `end_date` varchar(45) DEFAULT NULL,
  `participents_limit` int DEFAULT NULL,
  `status` varchar(45) DEFAULT NULL,
  `type` varchar(45) DEFAULT NULL,
  `rating` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `events`
--

LOCK TABLES `events` WRITE;
/*!40000 ALTER TABLE `events` DISABLE KEYS */;
INSERT INTO `events` VALUES (1,'eyas2@eyas.com','abu_sinan','10',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'food',NULL),(2,'cleaning','abu_sinan','volunteer',1,'firas, eyab',NULL,NULL,NULL,NULL,NULL,NULL,NULL,'active','food',NULL),(3,'cleaning','abu_sinan','volunteer',1,'firas, eyab',NULL,NULL,NULL,NULL,NULL,NULL,NULL,'active',NULL,NULL),(4,'cleaning','abu_sinan','volunteer',2,'firas, eyab','12:00:00','22-12-20','12:00:00','12:00:00','22-12-20','22-12-20',1,'active',NULL,NULL);
/*!40000 ALTER TABLE `events` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `events_participents`
--

DROP TABLE IF EXISTS `events_participents`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `events_participents` (
  `id` int NOT NULL AUTO_INCREMENT,
  `event_id` int DEFAULT NULL,
  `user_id` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `events_participents`
--

LOCK TABLES `events_participents` WRITE;
/*!40000 ALTER TABLE `events_participents` DISABLE KEYS */;
INSERT INTO `events_participents` VALUES (1,2,1),(2,2,2);
/*!40000 ALTER TABLE `events_participents` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `organizations`
--

DROP TABLE IF EXISTS `organizations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `organizations` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(45) DEFAULT NULL,
  `phone` varchar(45) DEFAULT NULL,
  `t_phone` varchar(45) DEFAULT NULL,
  `email` varchar(45) DEFAULT NULL,
  `address` varchar(45) DEFAULT NULL,
  `city` varchar(45) DEFAULT NULL,
  `zip` varchar(45) DEFAULT NULL,
  `fax` varchar(45) DEFAULT NULL,
  `rank` varchar(45) DEFAULT NULL,
  `password` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `organizations`
--

LOCK TABLES `organizations` WRITE;
/*!40000 ALTER TABLE `organizations` DISABLE KEYS */;
INSERT INTO `organizations` VALUES (1,'apple','2','2','@hy','2','acre','11111','11111','1','123');
/*!40000 ALTER TABLE `organizations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `organizations_members`
--

DROP TABLE IF EXISTS `organizations_members`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `organizations_members` (
  `id` int NOT NULL AUTO_INCREMENT,
  `organization_id` varchar(45) DEFAULT NULL,
  `user_id` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `organizations_members`
--

LOCK TABLES `organizations_members` WRITE;
/*!40000 ALTER TABLE `organizations_members` DISABLE KEYS */;
/*!40000 ALTER TABLE `organizations_members` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `first_name` varchar(45) DEFAULT NULL,
  `last_name` varchar(45) DEFAULT NULL,
  `email` varchar(45) DEFAULT NULL,
  `password` varchar(45) DEFAULT NULL,
  `phone` varchar(45) DEFAULT NULL,
  `t_phone` varchar(45) DEFAULT NULL,
  `address` varchar(45) DEFAULT NULL,
  `gender` varchar(45) DEFAULT NULL,
  `user_name` varchar(45) DEFAULT NULL,
  `rank` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'firas','sam','@hy','123','1231','123','acre','male','s',NULL),(2,'2','2','2','2','2','2','2','male','2',NULL),(3,'2','2','2','2','2','2','2','male','2',NULL),(4,'2','2','2','2','2','2','2','male','2',NULL),(5,'2','2','2','2','2','2','2','male','2',1),(6,NULL,NULL,'@hy','123','2','2','2',NULL,NULL,1);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-21  2:28:31
